Data/Final_Implemented_data/Request/400 requests/random/test_rand1.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient)


Server Software:        SimpleHTTP/0.6
Server Hostname:        10.1.0.0
Server Port:            80

Document Path:          /test_100kb.txt
Document Length:        102400 bytes

Concurrency Level:      10
Time taken for tests:   17.402 seconds
Complete requests:      400
Failed requests:        0
Total transferred:      41036000 bytes
HTML transferred:       40960000 bytes
Requests per second:    22.99 [#/sec] (mean)
Time per request:       435.055 [ms] (mean)
Time per request:       43.505 [ms] (mean, across all concurrent requests)
Transfer rate:          2302.83 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       66  353 117.4    344     685
Processing:     1   79  77.0     63     693
Waiting:        1   77  76.6     61     693
Total:         85  432 136.9    421     929

Percentage of the requests served within a certain time (ms)
  50%    421
  66%    481
  75%    526
  80%    546
  90%    633
  95%    670
  98%    707
  99%    777
 100%    929 (longest request)